monty-hall.org
#+TITLE: MATT THOMPSON
-----
* Solving the Monty Hall problem in Clojure

At this week's Bristol Clojurians meetup we decided to give the Monty Hall problem a go as described in the [[http://cyber-dojo.org][cyber dojo]] problem set. Here's the solution I (eventually) came up with:

#+HTML:<script src="https://gist.github.com/cblop/c4254965e599911cfe6c.js"></script>

This turned out to be a lot trickier than it looks. I ended up spending way more time than necessary hacking emoji support into Emacs to display little car and goat icons. Important things first, right?

-----

#+HTML:<div align=center>
[[http://mthompson.org][Home]]
#+HTML:</div>
