monty-hall.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
          "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
  <head>
    <meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
    <meta  name="viewport" content="width=device-width, initial-scale=1" />
    <title>MATT THOMPSON</title>
    <meta  name="generator" content="Org-mode" />
    <link rel="stylesheet" type="text/css" href="style.css" />
  </head>
  <body>
    <div id="content">
      <header>
        <h1 class="title">MATT THOMPSON</h1>
      </header><hr  />
      <div id="outline-container-orgheadline1" class="outline-2">
        <h2 id="orgheadline1">Solving the Monty Hall problem in Clojure</h2>
        <div class="outline-text-2" id="text-orgheadline1">
          <p>
            At this week's Bristol Clojurians meetup we decided to give the Monty Hall problem a go as described in the <a href="http://cyber-dojo.org/">cyber dojo</a> problem set. Here's the solution I (eventually) came up with:
          </p>

          <script src="https://gist.github.com/cblop/c4254965e599911cfe6c.js"></script>

          <p>
            This turned out to be a lot trickier than it looks. I ended up spending way more time than necessary hacking emoji support into Emacs to display little car and goat icons. Important things first, right?
          </p>

          <hr  />

          <div align=center>
            <p>
              <a href="http://mthompson.org/">Home</a>
            </p>
          </div>
        </div>
      </div>
    </div>
  </body>
</html>
